docs/vocabulary_development/dotfiles/DataFlow.dot
strict digraph  {
LowPassFilter;
Derivation;
TransmissionLine;
ForceFromLoadPinsTransformation;
DrawWorksControlSystem;
Integration;
RangeExtraction;
ControlSystem;
NumberOfItemsRangeExtraction;
TimeWindowRangeExtraction;
MeasuredDepthTranslation;
Filter;
TimeWindowMovingAverage;
DDHubNode;
MovingAverage;
PressureToForceTransformation;
DirectTransformation;
BandPassFilter;
Resampling;
ForceToLoadTransformation;
DataFlowNode;
ComputationUnit;
Aggregation;
Buffering;
Controller;
MeasuredDepthToTrueVerticalDepthTransformation;
NumberOfSampleMovingAverage;
Transformation;
HighPassFilter;
SignalProcessingUnit;
MudPumpsControlSystem;
TimeBasedTransformation;
TopDriveControlSystem;
UserInterface;
MeasurementDevice;
PressureToEquivalentDensityTransformation;
TorqueToForceTransformation;
LowPassFilter -> Filter  [label=SUBCLASS_OF];
Derivation -> TimeBasedTransformation  [label=SUBCLASS_OF];
TransmissionLine -> DataFlowNode  [label=SUBCLASS_OF];
ForceFromLoadPinsTransformation -> DirectTransformation  [label=SUBCLASS_OF];
DrawWorksControlSystem -> ControlSystem  [label=SUBCLASS_OF];
Integration -> TimeBasedTransformation  [label=SUBCLASS_OF];
RangeExtraction -> TimeBasedTransformation  [label=SUBCLASS_OF];
ControlSystem -> DataFlowNode  [label=SUBCLASS_OF];
NumberOfItemsRangeExtraction -> RangeExtraction  [label=SUBCLASS_OF];
TimeWindowRangeExtraction -> RangeExtraction  [label=SUBCLASS_OF];
MeasuredDepthTranslation -> DirectTransformation  [label=SUBCLASS_OF];
Filter -> SignalProcessingUnit  [label=SUBCLASS_OF];
TimeWindowMovingAverage -> MovingAverage  [label=SUBCLASS_OF];
MovingAverage -> Filter  [label=SUBCLASS_OF];
PressureToForceTransformation -> DirectTransformation  [label=SUBCLASS_OF];
DirectTransformation -> Transformation  [label=SUBCLASS_OF];
BandPassFilter -> Filter  [label=SUBCLASS_OF];
Resampling -> TimeBasedTransformation  [label=SUBCLASS_OF];
ForceToLoadTransformation -> DirectTransformation  [label=SUBCLASS_OF];
DataFlowNode -> DDHubNode  [label=SUBCLASS_OF];
ComputationUnit -> DataFlowNode  [label=SUBCLASS_OF];
Aggregation -> DirectTransformation  [label=SUBCLASS_OF];
Buffering -> TimeBasedTransformation  [label=SUBCLASS_OF];
Controller -> DataFlowNode  [label=SUBCLASS_OF];
MeasuredDepthToTrueVerticalDepthTransformation -> DirectTransformation  [label=SUBCLASS_OF];
NumberOfSampleMovingAverage -> MovingAverage  [label=SUBCLASS_OF];
Transformation -> DataFlowNode  [label=SUBCLASS_OF];
HighPassFilter -> Filter  [label=SUBCLASS_OF];
SignalProcessingUnit -> Transformation  [label=SUBCLASS_OF];
MudPumpsControlSystem -> ControlSystem  [label=SUBCLASS_OF];
TimeBasedTransformation -> Transformation  [label=SUBCLASS_OF];
TopDriveControlSystem -> ControlSystem  [label=SUBCLASS_OF];
UserInterface -> DataFlowNode  [label=SUBCLASS_OF];
MeasurementDevice -> DataFlowNode  [label=SUBCLASS_OF];
PressureToEquivalentDensityTransformation -> DirectTransformation  [label=SUBCLASS_OF];
TorqueToForceTransformation -> DirectTransformation  [label=SUBCLASS_OF];
}
